n5/src/Documents/TimeEntry/TimeEntry.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>TimeEntry</name>
  <basedOn>Catalog.Projects</basedOn>
  <basedOn>Task.UserTask</basedOn>
  <basedOn>Document.InternalOrder</basedOn>
  <basedOn>Document.SalesOrder</basedOn>
  <basedOn>Document.Event</basedOn>
  <registerRecords>AccumulationRegister.ProjectsCost</registerRecords>
  <registerRecords>AccumulationRegister.Work</registerRecords>
  <registerRecords>InformationRegister.TimeEntryRates</registerRecords>
  <attributes>
    <name>Appearance</name>
    <type>
      <types>CatalogRef.CalendarAppearance</types>
    </type>
  </attributes>
  <attributes>
    <name>BillableMinutes</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>DocumentOrder</name>
    <type>
      <types>DocumentRef.InternalOrder</types>
      <types>DocumentRef.SalesOrder</types>
      <types>DocumentRef.ProductionOrder</types>
    </type>
  </attributes>
  <attributes>
    <name>Duration</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Employee</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Event</name>
    <type>
      <types>DocumentRef.Event</types>
    </type>
  </attributes>
  <attributes>
    <name>Individual</name>
    <type>
      <types>CatalogRef.Individuals</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Minutes</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Performer</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Project</name>
    <type>
      <types>CatalogRef.Projects</types>
    </type>
  </attributes>
  <attributes>
    <name>Reminder</name>
    <type>
      <types>EnumRef.Reminder</types>
    </type>
  </attributes>
  <attributes>
    <name>ReminderDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Signature</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Signer</name>
    <type>
      <types>CatalogRef.Contacts</types>
    </type>
  </attributes>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Capacity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>RowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Series</name>
      <type>
        <types>CatalogRef.Series</types>
      </type>
    </attributes>
    <attributes>
      <name>Warehouse</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Tasks</name>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>600</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DocumentOrder</name>
      <type>
        <types>DocumentRef.InternalOrder</types>
        <types>DocumentRef.SalesOrder</types>
      </type>
    </attributes>
    <attributes>
      <name>DocumentOrderRowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Duration</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Minutes</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Task</name>
      <type>
        <types>CatalogRef.Tasks</types>
      </type>
    </attributes>
    <attributes>
      <name>TimeEnd</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>TimeStart</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>TimeType</name>
      <type>
        <types>EnumRef.Time</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

n5/src/Catalogs/Users/Users.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Users</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>AccessDenied</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AccessRevoked</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ApproveSalesOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ChangeInternalOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ChangeSalesOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CompanyAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>DefinedType.Email</types>
    </type>
  </attributes>
  <attributes>
    <name>Employee</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>FirstName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>FullName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Gender</name>
    <type>
      <types>EnumRef.Sex</types>
    </type>
  </attributes>
  <attributes>
    <name>Language</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LastName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Login</name>
    <type>
      <types>CatalogRef.Logins</types>
    </type>
  </attributes>
  <attributes>
    <name>OrganizationAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <attributes>
    <name>OSAuth</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>OSUser</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Patronymic</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Protection</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Show</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TimeZone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TrackingDistance</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TrackingPeriodicity</name>
    <type>
      <types>EnumRef.Frequency</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackingProvider</name>
    <type>
      <types>EnumRef.Providers</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackingTime</name>
    <type>
      <types>EnumRef.Frequency</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackLocation</name>
    <type>
      <types>EnumRef.Tracking</types>
    </type>
  </attributes>
  <attributes>
    <name>UserClass</name>
    <type>
      <types>EnumRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>WarehouseAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Companies</name>
    <attributes>
      <name>Company</name>
      <type>
        <types>CatalogRef.Companies</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Organizations</name>
    <attributes>
      <name>Organization</name>
      <type>
        <types>CatalogRef.Organizations</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>OrganizationsStates</name>
    <attributes>
      <name>State</name>
      <type>
        <types>CatalogRef.States</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Rights</name>
    <attributes>
      <name>RoleName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Warehouses</name>
    <attributes>
      <name>Warehouse</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>WarehousesStates</name>
    <attributes>
      <name>State</name>
      <type>
        <types>CatalogRef.States</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

n5/src/CommonModules/TimeReminder/Module.bsl
Procedure Send ( TimeEntry ) export
	
	SetPrivilegedMode ( true );
	env = new Structure ();
	env.Insert ( "TimeEntry", TimeEntry );
	getData ( env );
	profile = MailboxesSrv.SystemProfile ();
	message = new InternetMailMessage ();
	setSenderAndReceiver ( env, message );
	setSubject ( env, message );
	setBody ( env, message );
	try
		MailboxesSrv.Post ( profile, message );
	except
		WriteLogEvent ( "MailboxesSrv.Post", EventLogLevel.Error, Metadata.ScheduledJobs.TimeReminder, , ErrorDescription () );
		return;
	endtry;
	Jobs.Remove ( TimeEntry );
	
EndProcedure 

Procedure getData ( Env )
	
	SQL.Init ( Env );
	sqlFields ( Env );
	Env.Q.SetParameter ( "Ref", Env.TimeEntry );
	SQL.Perform ( Env );

EndProcedure 

Procedure sqlFields ( Env )
	
	s = "
	|// @Fields
	|select top 1 Document.Customer.Description as Customer, Document.Project.Description as Project,
	|	Document.Employee.Description as Employee, Document.Creator.Email as CreatorEmail,
	|	case when Document.Creator <> Users.Ref then isnull ( Users.Email, """" ) else Document.Creator.Email end as EmployeeEmail,
	|	presentation ( Document.Ref ) as TimeEntryPresentation
	|from Document.TimeEntry as Document
	|	left join Catalog.Users as Users
	|	on Users.Employee = Document.Employee
	|	and not Users.DeletionMark
	|where Document.Ref = &Ref
	|;
	|// #Tasks
	|select Tasks.LineNumber as LineNumber, Tasks.TimeStart as TimeStart, Tasks.TimeEnd as TimeEnd, Tasks.Duration as Duration, Tasks.Description as Description,
	|	Tasks.Task.Description as TaskDescription
	|from Document.TimeEntry.Tasks as Tasks
	|where Tasks.Ref = &Ref
	|order by Tasks.LineNumber
	|";
	Env.Selection.Add ( s );
	
EndProcedure

Procedure setSenderAndReceiver ( Env, Message )
	
	Message.From = Cloud.Noreply ();
	Message.To.Add ( Env.Fields.CreatorEmail );
	if ( Env.Fields.EmployeeEmail <> ""
		and Env.Fields.EmployeeEmail <> Env.Fields.CreatorEmail ) then
		Message.Cc.Add ( Env.Fields.EmployeeEmail );
	endif; 
	
EndProcedure

Procedure setSubject ( Env, Message )
	
	description = "";
	if ( Env.Tasks.Count () > 0 ) then
		description = Env.Tasks [ 0 ].Description;
	endif; 
	if ( IsBlankString ( description ) ) then
		description = Env.Fields.Customer + ", " + Env.Fields.Project;
	endif; 
	Message.Subject = Output.ReminderSubject ( new Structure ( "ReminderDescription", description ) );
	
EndProcedure 

Procedure setBody ( Env, Message )
	
	rowParams = new Structure ( "LineNumber, TimeStart, TimeEnd, Duration, Description, TaskDescription" );
	s = "";
	for each row in Env.Tasks do
		FillPropertyValues ( rowParams, row, "LineNumber, Description, TaskDescription" );
		rowParams.TimeStart = Format ( row.TimeStart, "DF=HH:mm" );
		rowParams.TimeEnd = Format ( row.TimeEnd, "DF=HH:mm" );
		rowParams.Duration = Format ( row.Duration, "NFD=2; NDS=:" );
		s = s + Output.TimeEntryRow ( rowParams ) + Chars.LF;
	enddo; 
	bodyParams = new Structure ();
	bodyParams.Insert ( "TimeEntry", Env.Fields.TimeEntryPresentation );
	bodyParams.Insert ( "Employee", Env.Fields.Employee );
	bodyParams.Insert ( "Customer", Env.Fields.Customer );
	bodyParams.Insert ( "Project", Env.Fields.Project );
	bodyParams.Insert ( "Tasks", s );
	bodyParams.Insert ( "URL", Conversion.ObjectToURL ( Env.TimeEntry ) );
	Message.Texts.Add ( Output.ReminderBody ( bodyParams ) );
	
EndProcedure 

Procedure Write ( Object ) export
	
	SetPrivilegedMode ( true );
	p = new Array ();
	p.Add ( Object.Ref );
	job = ScheduledJobs.CreateScheduledJob ( Metadata.ScheduledJobs.TimeReminder );
	job.UserName = DF.Pick ( Object.Ref, "Creator.Description" );
	job.Parameters = p;
	job.Key = Object.Ref.UUID ();
	sessionDate = CurrentSessionDate ();
	timeOffset = sessionDate - CurrentDate ();
	job.Schedule.BeginDate = Object.ReminderDate - timeOffset;
	job.Schedule.BeginTime = Object.ReminderDate - timeOffset;
	job.Write ();
	
EndProcedure
